load-tests/results/html-report/statistics.json
{
  "2. POST /auth/login" : {
    "transaction" : "2. POST /auth/login",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 96104.92,
    "medianResTime" : 63730.5,
    "minResTime" : 468.0,
    "maxResTime" : 359673.0,
    "pct1ResTime" : 319017.2000000002,
    "pct2ResTime" : 359636.95,
    "pct3ResTime" : 359672.95,
    "throughput" : 0.18503270453052578,
    "receivedKBytesPerSec" : 0.09540748827355235,
    "sentKBytesPerSec" : 0.06739960819324815
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 183,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125747.4043715847,
    "medianResTime" : 58325.0,
    "minResTime" : 197.0,
    "maxResTime" : 422392.0,
    "pct1ResTime" : 359636.6,
    "pct2ResTime" : 363204.99999999994,
    "pct3ResTime" : 411735.75999999995,
    "throughput" : 0.3159950476841707,
    "receivedKBytesPerSec" : 0.16840860555529652,
    "sentKBytesPerSec" : 145.8464694406456
  },
  "4a. POST /chat — Enviar mensaje chatbot" : {
    "transaction" : "4a. POST /chat — Enviar mensaje chatbot",
    "sampleCount" : 32,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 125536.53124999999,
    "medianResTime" : 52944.0,
    "minResTime" : 309.0,
    "maxResTime" : 364088.0,
    "pct1ResTime" : 359625.0,
    "pct2ResTime" : 364088.0,
    "pct3ResTime" : 364088.0,
    "throughput" : 0.0593300157966167,
    "receivedKBytesPerSec" : 0.05139230860507717,
    "sentKBytesPerSec" : 0.023117847952002016
  },
  "4c. POST /upload-exercise-image — Solicitud OCR" : {
    "transaction" : "4c. POST /upload-exercise-image — Solicitud OCR",
    "sampleCount" : 25,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 284438.31999999995,
    "medianResTime" : 335069.0,
    "minResTime" : 43475.0,
    "maxResTime" : 422392.0,
    "pct1ResTime" : 409701.2,
    "pct2ResTime" : 418586.2,
    "pct3ResTime" : 422392.0,
    "throughput" : 0.04337657109940522,
    "receivedKBytesPerSec" : 0.013136662333347215,
    "sentKBytesPerSec" : 146.45037522360624
  },
  "4b. GET /reports/overview — Generar reporte" : {
    "transaction" : "4b. GET /reports/overview — Generar reporte",
    "sampleCount" : 26,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 87429.07692307694,
    "medianResTime" : 50142.5,
    "minResTime" : 197.0,
    "maxResTime" : 359672.0,
    "pct1ResTime" : 359645.3,
    "pct2ResTime" : 359662.9,
    "pct3ResTime" : 359672.0,
    "throughput" : 0.05110796163757772,
    "receivedKBytesPerSec" : 0.020987204949806087,
    "sentKBytesPerSec" : 0.01527249634872928
  }
}